** Packages
#+begin_src python
from datetime import datetime as dt

t1 = dt.now()

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm
plt.rc('axes', titlesize=22)     # fontsize of the axes title
plt.rcParams.update({"font.size": 15})
import pandas_datareader.data as web

from scipy.interpolate import make_interp_spline, BSpline  # Smooth plot

sns.set(style="whitegrid")
sns.set_context("paper")
#+end_src

#+RESULTS:
:results:
:end:


** Functions and variables

#+begin_src python
plt.rc('legend', fontsize=14)    # legend fontsize
def crise_subprime(axes, alpha=0.4):
    axes.axvspan(
        xmin="2007-12-01",
        xmax="2009-06-01",
        color="gray",
        label="subprime crisis",
        zorder=0,
        alpha=alpha,
    )


def crises(axes, color="lightgray", alpha=0.4):
    axes.axvspan(
        xmin="1953-07", xmax="1954-04", color=color, alpha=alpha, label="Recession"
    )
    axes.axvspan(xmin="1957-08", xmax="1958-05", color=color, alpha=alpha, label="")
    axes.axvspan(xmin="1960-05", xmax="1961-02", color=color, alpha=alpha, label="")
    axes.axvspan(xmin="1969-12", xmax="1970-11", color=color, alpha=alpha, label="")
    axes.axvspan(xmin="1973-11", xmax="1975-03", color=color, alpha=alpha, label="")
    axes.axvspan(xmin="1980-01", xmax="1980-07", color=color, alpha=alpha, label="")
    axes.axvspan(xmin="1981-07", xmax="1982-01", color=color, alpha=alpha, label="")
    axes.axvspan(xmin="1990-07", xmax="1991-03", color=color, alpha=alpha, label="")
    axes.axvspan(xmin="2001-03", xmax="2001-11", color=color, alpha=alpha, label="")


start = dt(1949, 1, 1)
end = dt(2019, 1, 1)
recessions = web.get_data_fred("USRECM", start, end)
recessions.columns = ["Recessions"]
recessions["xmin"] = False
recessions["xmax"] = False
for i in range(len(recessions["Recessions"]) - 1):
    recessions.iscopy = True
    if (
        recessions["Recessions"].iloc[i] == 0
        and recessions["Recessions"].iloc[i + 1] == 1
    ):
        recessions["xmin"].iloc[i + 1] = True
    elif (
        recessions["Recessions"].iloc[i] == 1
        and recessions["Recessions"].iloc[i + 1] == 0
    ):
        recessions["xmax"].iloc[i + 1] = True


def recessions_bars(ax):
    import matplotlib.pyplot as plt

    xmin = recessions[recessions["xmin"] == True]["xmin"]
    xmax = recessions[recessions["xmax"] == True]["xmax"]

    for i in range(len(xmax)):
        ax.axvspan(xmin=xmin.index[i], xmax=xmax.index[i], alpha=0.3, color="k")


def default_plot():
    plt.xlabel("")
    sns.set_context("talk")
    plt.rcParams["axes.edgecolor"] = "#333F4B"
    plt.rcParams["axes.linewidth"] = 0.8
    plt.rcParams["xtick.color"] = "#333F4B"
    plt.rcParams["ytick.color"] = "#333F4B"
    ax.grid(False)
    ax.spines["top"].set_color("none")
    ax.spines["right"].set_color("none")
    ax.spines["left"].set_smart_bounds(True)
    ax.spines["bottom"].set_smart_bounds(True)
    sns.despine()


def salvar_grafico(file_name, extension="png", pasta="./figs/"):
    fig.savefig(
        pasta + file_name + "." + extension,
        dpi=600,
        bbox_inches="tight",
        format=extension,
        pad_inches=0.2,
        transparent=False,
    )
#+end_src

#+RESULTS:
:results:
/home/gpetrini/.local/lib/python3.8/site-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)
:end:

** Demanda agregada

#+BEGIN_SRC python
from matplotlib.patches import Ellipse, Polygon

start = dt(1979, 1, 1)
end = dt(2020, 12, 31)

df = web.get_data_fred(
    [
        "PCEC",  # Personal consuption
        "PNFI",  # Private non-residential fixed investment
        "PRFI",  # Private residential fixed investment
        "GCE",  # Governement expenditures
        "EXPGS",  # Exports
    ],
    start,
    end,
)

df.columns = [
    "Personal consumption expend.",
    "Non Residential investment",
    "Residential investment",
    "Government Expenditures",
    "Exports",
]


df["AD"] = df.sum(axis=1)

df = df.resample("QS").mean()
df.index.name = ""
df = df.apply(lambda x: x / df["AD"]).drop(["AD"], axis="columns")
fig, ax = plt.subplots(1, 1, figsize=(19.2, 10.8))


df.plot(
    kind="area",
    stacked=True,
    ax=ax,
    legend=False,
    color=(
        "#000000",
        "#333333",
        "#ffffff",
        "#888888",
        "#cccccc",
    ),
)

df.plot(kind="line", stacked=True, ax=ax, legend=False, color="white", label=None)

handles, labels = ax.get_legend_handles_labels()
ax.legend(
    handles[:4:-1],
    labels[:4:-1],
    loc="center left",
    bbox_to_anchor=(1, 0.5),
    title="Expenditures (in order)",
    title_fontsize=18,
)

# ax.text('1980', 0.2, s=df.columns[0], color="white", fontsize=18, fontfamily='serif')
# ax.text('1980', 0.6, s=df.columns[1], color="white", fontsize=18, fontfamily='serif')
# ax.text('1980', 0.7, s=df.columns[2], color="black", fontsize=18, fontfamily='serif')
# ax.text('1980', 0.8, s=df.columns[3], color="black", fontsize=18, fontfamily='serif')
# ax.text('1980', 0.95, s=df.columns[4], color="black", fontsize=18, fontfamily='serif')


ax.set_ylim(0, 1)
ax.set_xlabel("")
ax.tick_params(axis="both", which="major", labelsize=15)

sns.despine()
plt.tight_layout()
plt.close()
salvar_grafico(file_name="Share_AD")
#+END_SRC

#+RESULTS:
:results:
:end:

** Ciclo e tendência

#+BEGIN_SRC python
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import pandas_datareader.data as web
from datetime import datetime as dt
import statsmodels.api as sm

start = dt(1979, 1, 1)
end = dt(2020, 12, 31)

df = web.DataReader(["GDPC1", "PRFI"], "fred", start, end)

df.columns = [
    "GDP",
    "Residential Investment",
]
df.index.name = ""
df = df.pct_change().dropna()

cycle, trend = sm.tsa.filters.hpfilter(df["GDP"], 1600)
_cycle, _trend = sm.tsa.filters.hpfilter(df["Residential Investment"], 1600)

df = pd.concat([trend, _trend], axis=1)
df.columns = [
    "GDP",
    "Residential Investment",
]

fig, ax = plt.subplots(1, 1, figsize=(8, 5))

df.plot(ax=ax, color=("black", "darkgrey"))
crise_subprime(ax)
crises(ax)

ax.tick_params(axis="both", which="major", labelsize=15)
ax.legend(fontsize=14)
sns.despine()
plt.xlabel("")
salvar_grafico(file_name="Trend")
plt.close()
#+END_SRC

#+RESULTS:
:results:
:end:

